app/controllers/admins_controller.rb

SELECT `admins`.* FROM `admins`
---
  def index
    if current_user.present?
      @admins = Admin.all

INSERT INTO `admins` (`nome`, `created_at`, `updated_at`) VALUES ('fernando1', '2016-02-26 00:21:48', '2016-02-26 00:21:48')
---
  def create
    @admin = Admin.new(admin_params)

    respond_to do |format|
      if @admin.save

SELECT  `admins`.* FROM `admins` WHERE `admins`.`id` = 1 LIMIT 1
---
    def set_admin
      @admin = Admin.find(params[:id])